# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Shell (see .zshrc — these power the prompt, autocomplete & history search)
brew 'starship' # Prompt: directory + git branch + git changes
brew 'zsh-autosuggestions' # Gray "ghost text" autocomplete from history
brew 'zsh-syntax-highlighting' # Colours valid/invalid commands as you type
brew 'zsh-completions' # Extra tab-completion definitions
brew 'fnm' # Fast Node version manager (auto-switches per project)
brew 'fzf' # Fuzzy finder: Ctrl-R history, Ctrl-T files, Alt-C cd
brew 'zoxide' # Smart `z` command to jump to frequent directories

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.2'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'herd' # Laravel Herd (PHP + valet-style local dev; replaces Valet)
cask '1password'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'pastebot'
cask 'phpmon'
cask 'phpstorm'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'whatsapp'
